Revit 2024 API
PartUtils.GetSplittingElements Method
 Identifies the elements ( reference planes, levels, grids ) that were used to create the part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019.1
Syntax
C#
public static ISet<ElementId> GetSplittingElements(
	Document document,
	ElementId partId
)
Visual Basic
Public Shared Function GetSplittingElements ( _
	document As Document, _
	partId As ElementId _
) As ISet(Of ElementId)
Visual C++
public:
static ISet<ElementId^>^ GetSplittingElements(
	Document^ document,
	ElementId^ partId
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The source document of the part.
partId
Type: Autodesk.Revit.DB.ElementId
 The part id.
Return Value
 The elements that created the part. Empty if partId is not a Part or Part is not divided.
Examples
CopyC#
public void GetElementDividers(Part part)
{
   StringBuilder message = new StringBuilder();
   // Get Element dividers.
   ISet<ElementId> divisionElements = PartUtils.GetSplittingElements(part.Document, part.Id);
   if (divisionElements.Count == 0)
      message.AppendLine("Part is not divided.");
   else
   {
      message.AppendLine("The dividers are : ");
      foreach (var reference in divisionElements)
      {
         Element element = part.Document.GetElement(reference);
         message.AppendLine(element.GetType().Name + " " + element.Id.ToString() + " ");
      }
   }
   TaskDialog.Show("Revit", message.ToString());
}
CopyVB.NET
Private Sub GetElementDividers(ByVal part As Part)
    Dim message As StringBuilder = New StringBuilder
    ' Get Element dividers.
    Dim divisionElements As ISet(Of ElementId) = PartUtils.GetSplittingElements(part.Document, part.Id)
    If (divisionElements.Count = 0) Then
        message.AppendLine("Part is not divided.")
    Else
        message.AppendLine("The dividers are : ")
        For Each reference In divisionElements
            Dim element As Element = part.Document.GetElement(reference)
            message.AppendLine(element.GetType.Name + " " + element.Id.ToString)
        Next
    End If
    TaskDialog.Show("Revit", message.ToString)
End Sub
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
PartUtils Class
Autodesk.Revit.DB Namespace